xml/soapCalendarRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:mes="http://schemas.microsoft.com/exchange/services/2006/messages">
   <soapenv:Header>
   </soapenv:Header>
   <soapenv:Body>
      <mes:FindItem Traversal="Shallow">
         <mes:ItemShape>
            <typ:BaseShape>IdOnly</typ:BaseShape>
         </mes:ItemShape>
         <!--You have a CHOICE of the next 4 items at this level-->
         <mes:CalendarView MaxEntriesReturned="{{ .MaxFetchSize }}" StartDate="{{ .StartDate }}" EndDate="{{ .EndDate }}"/>
         <mes:ParentFolderIds>
           <!--You have a CHOICE of the next 2 items at this level-->
            <typ:FolderId Id="{{ .FolderId }}" ChangeKey="{{ .ChangeKey }}" />
         </mes:ParentFolderIds>
      </mes:FindItem>
   </soapenv:Body>
</soapenv:Envelope>
